tests/api/users/me/payments/_get/200_paid-and-processing.json

{
  "results": [
    {
      "id": 2,
      "status": "processing",
      "amount": {
        "net": {
          "value": 10,
          "currency": "EUR"
        },
        "gross": {
          "value": 13.5,
          "currency": "EUR"
        }
      },
      "paidDate": "-",
      "method": {
        "type": "paypal",
        "note": "me@example.com"
      },
      "receipt": "http://example.com"
    },
    {
      "id": 1,
      "status": "paid",
      "amount": {
        "net": {
          "value": 10,
          "currency": "EUR"
        },
        "gross": {
          "value": 13.5,
          "currency": "EUR"
        }
      },
      "paidDate": "2019-08-24",
      "method": {
        "type": "paypal",
        "note": "me@example.com"
      },
      "receipt": "http://example.com"
    }
  ],
  "limit": 10,
  "size": 2,
  "start": 0,
  "total": 2
}
